INSERT INTO institutes (name) 
VALUES ('Институт математики и информатики') 
RETURNING id;

INSERT INTO groups (name, code, year, institute_id) VALUES
('Информатика и вычислительная техника', 'Б-ИВТ-25-1', 2025, 1),
('Информатика и вычислительная техника', 'Б-ИВТ-25-2', 2025, 1),
('Фундаментальная информатика и информационные технологии', 'Б-ФИИТ-25', 2025, 1),
('Прикладная информатика', 'Б-ПИ-25-1', 2025, 1)
RETURNING id;

SELECT id FROM groups WHERE code = 'Б-ИВТ-25-1';

INSERT INTO students (last_name, first_name, middle_name, group_id) VALUES
('Новиков','Ёркён','Станиславович',1),
('Иванов','Иван',NULL,1),
('Семенов','Максим','Николаевич',1),
('Амвросьев','Данил','Николаевич',1),
('Борисов','Любомир','Артемович',1),
('Васильев','Иван',NULL,1),
('Ермолаев','Айсен','Айалович',1),
('Иванов','Никита','Анатольевич',1),
('Бояров','Максим','николаевич',1),
('Иванов','Эрхан','Вадимович',1),
('Леденёв','Никита','Валерьевич',1),
('Орбу','Артём','Русланович',1),
('Петров','Кирилл','Аркадьевич',1),
('Петров','Эльдар','Игоревич',1),
('Соловьев','Роман','Романович',1),
('Софронов','Антон','Альбертович',1),
('Степанов','Артур','Русланович',1);

SELECT * FROM institutes;

SELECT g.*, i.name as institute_name 
FROM groups g 
LEFT JOIN institutes i ON g.institute_id = i.id;

SELECT s.*, g.code as group_code, g.name as group_name
FROM students s 
LEFT JOIN groups g ON s.group_id = g.id;
